In [1]:
import pandas as pd
from sqlalchemy import *

db_path = 'postgresql://eqpytyddkgzpje:589827916509690e9baa1abd869d99bd85ac3c9902c361d04c1e560c2befd624@ec2-52-54-38-229.compute-1.amazonaws.com:5432/dap64di8scvd9n'
eng = create_engine(db_path)

In [2]:
pd.read_sql('''select * from "Confirmation";''',eng).head(10)

   id  recording_id  source_id  location_id
0   1            17         47            1

In [3]:
pd.read_sql('''select * from "Location";''',eng).head(10)

   id annotation_id  azimuth  elevation  color  practice_round
0   1             1      275          2      1           False

In [4]:
pd.read_sql('''select * from "Survey";''',eng).head(10)

   id                             survey_id
0   1  1b88c396-0fd2-4a66-9c5d-98ecf540ce4e

In [5]:
pd.read_sql('''select * from "Annotation";''',eng).head(10)

,id,survey_id,recording_id,source_count,user_note,practice_round
0,1,1b88c396-0fd2-4a66-9c5d-98ecf540ce4e,17,1,people on the left side,False

In [6]:
pd.read_sql('''select * from "Location";''',eng).head(10)

   id annotation_id  azimuth  elevation  color  practice_round
0   1             1      275          2      1           False

In [7]:
pd.read_sql('''select * from "Interaction";''',eng).head(10)

,id,annotation_id,action_type,value,timestamp,practice_round
0,1,1,play audio,None,2022-01-29 23:10:51.134,False
1,2,1,source count,1,2022-01-29 23:11:02.508,False
2,3,1,azimuth,275,2022-01-29 23:11:03.513,False
3,4,1,elevation,2,2022-01-29 23:11:04.303,False
4,5,1,submit,None,2022-01-29 23:11:10.532,False

In [8]:
pd.read_sql('''select * from "Recording";''',eng).head(10)

,id,recording_name,file_name,num_annotation,actual_num_source
0,1,sources_3_recording_130.wav,0.wav,0,3
1,2,sources_9_recording_10.wav,1.wav,0,9
2,3,sources_3_recording_160.wav,2.wav,0,3
3,4,sources_1_recording_157.wav,3.wav,0,1
4,5,sources_5_recording_129.wav,4.wav,0,5
5,6,sources_6_recording_80.wav,5.wav,0,6
6,7,sources_6_recording_51.wav,6.wav,0,6
7,8,sources_7_recording_48.wav,7.wav,0,7
8,9,sources_8_recording_135.wav,8.wav,0,8
9,10,sources_2_recording_52.wav,9.wav,0,2